---
kind: property
id: P:Autodesk.Revit.UI.FileDialog.Title
source: html/0755dfb7-9c56-77f0-4353-8e5f2e8c74ba.htm
---
# Autodesk.Revit.UI.FileDialog.Title Property

The title to show on the dialog.

## Syntax (C#)
```csharp
public string Title { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: title cannot include prohibited unprintable characters.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null